In [1]:
#Chap11_판다스의 집계함수사용하기.ipynb 
from pandas import Series, DataFrame
import pandas as pd 
import numpy as np 

df = DataFrame({"key1":["a","a","b","b","a","a","a","b","b","a"], 
                "key2":["one","two","one","two","one","one","two","one","two","one"], 
                "col1":np.random.randn(10),
                "col2":np.random.randn(10)
                })
df

  key1 key2      col1      col2
0    a  one  1.120116 -0.390039
1    a  two -0.657249 -0.322904
2    b  one -0.648272  1.636410
3    b  two  0.318605  0.493439
4    a  one  1.997052  1.142760
5    a  one  1.180201  0.955958
6    a  two  0.255087 -1.065527
7    b  one  0.473553  1.442098
8    b  two -1.403429 -0.467866
9    a  one  0.283074  2.600849

In [2]:
grouped = df.groupby("key1")["col1"]
grouped

In [3]:
print(grouped.sum())
print(grouped.mean())
print(grouped.count())

key1
a    4.178281
b   -1.259543
Name: col1, dtype: float64
key1
a    0.696380
b   -0.314886
Name: col1, dtype: float64
key1
a    6
b    4
Name: col1, dtype: int64

In [4]:
#학급 성적 
dfClass = DataFrame({"학급":[1,1,2,2,1], 
                     "이름":["홍길동","전우치","이순신","박문수","김길동"],
                     "국어":[100,90,95,100,80], 
                     "영어":[80,90,95,92,89], 
                     "수학":[90,80,92,100,80]
                     })

dfClass

   학급   이름   국어  영어   수학
0   1  홍길동  100  80   90
1   1  전우치   90  90   80
2   2  이순신   95  95   92
3   2  박문수  100  92  100
4   1  김길동   80  89   80

In [5]:
dfClass["국어"]

0    100
1     90
2     95
3    100
4     80
Name: 국어, dtype: int64

In [6]:
sum(dfClass["국어"])

465

In [7]:
sum(dfClass["국어"])/5

93.0

In [8]:
dfClass.sort_values("국어")

   학급   이름   국어  영어   수학
4   1  김길동   80  89   80
1   1  전우치   90  90   80
2   2  이순신   95  95   92
0   1  홍길동  100  80   90
3   2  박문수  100  92  100

In [9]:
dfClass.sort_values("국어", ascending=False)

   학급   이름   국어  영어   수학
0   1  홍길동  100  80   90
3   2  박문수  100  92  100
2   2  이순신   95  95   92
1   1  전우치   90  90   80
4   1  김길동   80  89   80

In [10]:
dfClass["총점"] = dfClass["국어"] + dfClass["수학"] + dfClass["영어"]

In [11]:
dfClass["평균"] = (dfClass["국어"] + dfClass["수학"] + dfClass["영어"])/3

In [12]:
dfClass

   학급   이름   국어  영어   수학   총점         평균
0   1  홍길동  100  80   90  270  90.000000
1   1  전우치   90  90   80  260  86.666667
2   2  이순신   95  95   92  282  94.000000
3   2  박문수  100  92  100  292  97.333333
4   1  김길동   80  89   80  249  83.000000

In [13]:
dfClass.sort_values("평균", ascending=False)

   학급   이름   국어  영어   수학   총점         평균
3   2  박문수  100  92  100  292  97.333333
2   2  이순신   95  95   92  282  94.000000
0   1  홍길동  100  80   90  270  90.000000
1   1  전우치   90  90   80  260  86.666667
4   1  김길동   80  89   80  249  83.000000

In [14]:
dfClass.groupby("학급")["국어"].mean()

학급
1    90.0
2    97.5
Name: 국어, dtype: float64

In [18]:
dfClass.groupby("학급").agg(수학평균=("수학","mean"))

         수학평균
학급
1   83.333333
2   96.000000

In [ ]:
#실수부분을 2자리까지만 출력하기 
dfClass.groupby("학급").agg(수학평균=("수학", lambda x: round(x.mean(), 2)))

     수학평균
학급
1   83.33
2   96.00

In [22]:
dfClass.groupby("학급").agg(국어평균=("국어","mean"), 
            수학평균=("수학",lambda x: round(x.mean(),2)),
            영어평균=("영어",lambda x: round(x.mean(),2)), 
            갯수=("학급","count"))

    국어평균   수학평균   영어평균  갯수
학급
1   90.0  83.33  86.33   3
2   97.5  96.00  93.50   2